XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.V2M-MPS2_CMx_BSP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>V2M-MPS2_CMx_BSP</name>
  <description>ARM V2M-MPS2 Board Support PACK for Cortex-M System Design Kit Devices</description>

  <releases>
    <release version="1.8.2" date="2024-02-22">
      Reworked Startup:
      - added additional device header include file.
    </release>
    <release version="1.8.1" date="2023-09-04">
      Reworked GCC secure/non-secure example:
      - changed used CPUTYPE to ARMV8MBL.
      Reworked Board Support:
      - Removed Device.h
      Updated example projects.
    </release>
    <release version="1.8.0" date="2022-01-27">
      Added devices for Arm Virtual Hardware Targets (VHT).
      Removed @version, @date entries from device files.
      Reworked Startup:
      - Added GCC support.
      - Added ARMClang assembler startup.
      - Removed ARMCC5 assembler startup.
      Updated example projects.
    </release>
    <release version="1.7.2" date="2021-04-23">
      Board Support:
      - Updated LED driver.
    </release>
    <release version="1.7.1" date="2021-03-10">
      Updated examples to use Arm Compiler 6.
      Fixed device header files for CMSDK_CM7 device variants using correct lower case #include "core_cm7.h".
    </release>
    <release version="1.7.0" date="2018-06-11">
      Added MTB/ETM targets to ARMv8MBL Secure/Non-Secure example.
      Updated USART driver.
      Updated source and SVD files.
    </release>
    <release version="1.6.0" date="2017-02-08">
      Disable local processor reset for v8-M devices. Not available for this architecture.
      Updated ARMv8M Mainline FPU settings in partition*.h
      Updated ARMv8-M Mainline system file.
    </release>
    <release version="1.5.0" date="2016-11-14">
      Updated ARMv8-M device with processor attribute Dtz.
      Updated device startup files.
      Updated ARMv8MBL_S_NS example.
      Update Mainline and Baseline Debug Description to detect if Debug Authentication can be changed.
    </release>
    <release version="1.4.0" date="2016-09-29">
      ARMv8-M targets:
      - requiresARM.CMSIS.5.0.0-BETA12 pack.
      - updated ARMv8MBL_S_NS example.
      - updated CMSDK_ARMv8M partition file
      -- replaced macro definition __SAU_PRESENT with __SAU_REGION_PRESENT.
      -- corrected write access SCB_AIRCR register.
      - corrected GLCD driver for use with ARMCLANG and fixed warnings for all drivers.
      - added GCC based ARMv8MBL_S_NS example project.
      - added debug description for ARMv8-M Mainline device family (debug authentication).
      - corrected write access SCB_AIRCR register.
      Added CMSIS USART_Driver.
      Updated device descriptions: Configure JTAG as default debug protocol.
      Added CMSDK SVD files
    </release>
    <release version="1.3.0" date="2016-05-09">
      Added FastModels Target to all M0, M0+, M3, M4, M7 Examples (requires MDK-5.20 and MDK-Professional license)
      Updated CMSDK_ARMv8MML device files (requires ARM.CMSIS.5.0.0-BETA4 or higher)
      - added CMSDK_ARMv8MML_FP to CMSDK_ARMv8MML_SP, CMSDK_ARMv8MML_DP.
      - added SVD file for SAU in ARMv8MBL device
      - updated CMsDK_ARMv8MBL setting __MPU_PRESENT to 1
      - updated partition files
    </release>
    <release version="1.2.0" date="2016-04-07">
      CMSDK_ARMv8MBL example requires: ARM.CMSIS.5.0.0-BETA3.pack
      updated CMSDK_ARMv8MML and CMSDK_ARMv8MBL CMSIS device files
      - renamed core_ARMv8M?L.h to core_armv8m?l.h.
      - renamed partition_ARMv8M?L.h to partition_CMSDK_ARMv8M?L.h.
      - updated number of SAU regions from 4 to 8
      - moved TZ_SAU_Setup() to partition file
      - corrected CMSDK device interrupt assignment.
      updated Examples:
      - CMSDK_ARMv8MMLARMv8MBL example
      -- updated MTB setup to new MTB SFR base address
      -- support of example INI script from both secure and non-secure build targets
      - V2M-MPS2 Examples:
      -- reworked V2M-MPS2 board support
      -- reworked all RTX Blinky examples
      updated documentation
    </release>
    <release version="1.1.0" date="2014-09-24">
      Added Cortex-M7 Support/Examples.
      Updated device families and conditions to match CMSIS pack version 4.2.0.
      Added board description for "V2M-MPS2".
    </release>
    <release version="1.0.0">
      First Release version of V2M-MPS2 Board Support Pack including Device definition.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ARM</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package ARM CMSDK</keyword>
    <keyword>Board Support Package for V2M-MPS2</keyword>
    <keyword>CMSDK_CM0</keyword>
    <keyword>CMSDK_CM0plus</keyword>
    <keyword>CMSDK_CM3</keyword>
    <keyword>CMSDK_CM4</keyword>
    <keyword>CMSDK_CM7</keyword>
    <keyword>Arm Virtual Hardware Targets</keyword>
    <keyword>VHT</keyword>
  </keywords>

  <devices>
    <!-- ******************************  Cortex-M0  ****************************** -->
    <family Dfamily="ARM Cortex M0" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <book name="Documents/DUI0497A_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>
      <description>
Cortex-M System Design Kit: Cortex-M0 based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00400000" startup="1" default="1"/>
      <memory id="IRAM1" start="0x20000000" size="0x00400000" init   ="0" default="1"/>

      <device Dname="CMSDK_CM0">
        <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM0.svd"/>
        <compile header="Device/CMSDK_CM0/Include/CMSDK_CM0.h" define="CMSDK_CM0"/>
      </device>
      <device Dname="CMSDK_CM0_VHT">
        <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="25000000"/>
        <description>Arm Virtual Hardware Target (VHT)</description>
        <debug svd="SVD/CMSDK_CM0.svd"/>
        <compile header="Device/CMSDK_CM0/Include/CMSDK_CM0.h" define="CMSDK_CM0_VHT"/>
      </device>
    </family>

