XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.V2M-MPS2_CMx_BSP.pdsc
    <!-- ******************************  Cortex-M0P  ***************************** -->
    <family Dfamily="ARM Cortex M0 plus" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <book name="Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <description>
Cortex-M System Design Kit: Cortex-M0+ based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00400000" startup="1" default="1"/>
      <memory id="IRAM1" start="0x20000000" size="0x00400000" init   ="0" default="1"/>

      <device Dname="CMSDK_CM0plus">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM0plus.svd"/>
        <compile header="Device/CMSDK_CM0plus/Include/CMSDK_CM0plus.h" define="CMSDK_CM0plus"/>
      </device>
      <device Dname="CMSDK_CM0plus_VHT">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="25000000"/>
        <description>Arm Virtual Hardware Target (VHT)</description>
        <debug svd="SVD/CMSDK_CM0plus.svd"/>
        <compile header="Device/CMSDK_CM0plus/Include/CMSDK_CM0plus.h" define="CMSDK_CM0plus_VHT"/>
      </device>
    </family>

    <!-- ******************************  Cortex-M3  ****************************** -->
    <family Dfamily="ARM Cortex M3" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <book name="Documents/DUI0552A_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <description>
Cortex-M System Design Kit: Cortex-M3 based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00400000" startup="1" default="1"/>
      <memory id="IRAM1" start="0x20000000" size="0x00400000" init   ="0" default="1"/>

      <device Dname="CMSDK_CM3">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM3.svd"/>
        <compile header="Device/CMSDK_CM3/Include/CMSDK_CM3.h" define="CMSDK_CM3"/>
      </device>
      <device Dname="CMSDK_CM3_VHT">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <description>Arm Virtual Hardware Target (VHT)</description>
        <debug svd="SVD/CMSDK_CM3.svd"/>
        <compile header="Device/CMSDK_CM3/Include/CMSDK_CM3.h" define="CMSDK_CM3_VHT"/>
      </device>
    </family>

    <!-- ******************************  Cortex-M4  ****************************** -->
    <family Dfamily="ARM Cortex M4" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <book name="Documents/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
      <description>
Cortex-M System Design Kit: Cortex-M4 based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00400000" startup="1" default="1"/>
      <memory id="IRAM1" start="0x20000000" size="0x00400000" init   ="0" default="1"/>

      <device Dname="CMSDK_CM4">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM4.svd"/>
        <compile header="Device/CMSDK_CM4/Include/CMSDK_CM4.h" define="CMSDK_CM4"/>
      </device>
      <device Dname="CMSDK_CM4_VHT">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <description>Arm Virtual Hardware Target (VHT)</description>
        <debug svd="SVD/CMSDK_CM4.svd"/>
        <compile header="Device/CMSDK_CM4/Include/CMSDK_CM4.h" define="CMSDK_CM4_VHT"/>
      </device>

      <device Dname="CMSDK_CM4_FP">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM4_FP.svd"/>
        <compile header="Device/CMSDK_CM4/Include/CMSDK_CM4_FP.h" define="CMSDK_CM4_FP"/>
      </device>
      <device Dname="CMSDK_CM4_FP_VHT">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <description>Arm Virtual Hardware Target (VHT)</description>
        <debug svd="SVD/CMSDK_CM4_FP.svd"/>
        <compile header="Device/CMSDK_CM4/Include/CMSDK_CM4_FP.h" define="CMSDK_CM4_FP_VHT"/>
      </device>
    </family>

    <!-- ******************************  Cortex-M7  ****************************** -->
    <family Dfamily="ARM Cortex M7" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <book name="Documents/DUI0646B_cortex_m7_dgug.pdf" title="Cortex-M7 Generic User Guide"/>
      <description>
Cortex-M System Design Kit: Cortex-M7 based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00400000"  startup="1"  default="1"/>
      <memory id="IRAM1" start="0x20000000" size="0x00400000"  init   ="0"  default="1"/>

      <device Dname="CMSDK_CM7">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM7.svd"/>
        <compile header="Device/CMSDK_CM7/Include/CMSDK_CM7.h" define="CMSDK_CM7"/>
      </device>
      <device Dname="CMSDK_CM7_VHT">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <description>Arm Virtual Hardware Target (VHT)</description>
        <debug svd="SVD/CMSDK_CM7.svd"/>
        <compile header="Device/CMSDK_CM7/Include/CMSDK_CM7.h" define="CMSDK_CM7_VHT"/>
      </device>

      <device Dname="CMSDK_CM7_SP">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p0" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM7_SP.svd"/>
        <compile header="Device/CMSDK_CM7/Include/CMSDK_CM7_SP.h" define="CMSDK_CM7_SP"/>
      </device>
