XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.V2M-MPS2_CMx_BSP.pdsc
      <device Dname="CMSDK_CM7_SP_VHT">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p0" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <description>Arm Virtual Hardware Target (VHT)</description>
        <debug svd="SVD/CMSDK_CM7_SP.svd"/>
        <compile header="Device/CMSDK_CM7/Include/CMSDK_CM7_SP.h" define="CMSDK_CM7_SP_VHT"/>
      </device>

      <device Dname="CMSDK_CM7_DP">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p0" Dfpu="DP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM7_DP.svd"/>
        <compile header="Device/CMSDK_CM7/Include/CMSDK_CM7_DP.h" define="CMSDK_CM7_DP"/>
      </device>
      <device Dname="CMSDK_CM7_DP_VHT">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p0" Dfpu="DP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <description>Arm Virtual Hardware Target (VHT)</description>
        <debug svd="SVD/CMSDK_CM7_DP.svd"/>
        <compile header="Device/CMSDK_CM7/Include/CMSDK_CM7_DP.h" define="CMSDK_CM7_DP_VHT"/>
      </device>
    </family>

    <!-- ******************************  ARMv8-M Baseline  *********************** -->
    <family Dfamily="ARMv8-M Baseline" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <!--book name="Device/Documents/ARMv8MML_dgug.pdf" title="ARMv8MML Device Generic Users Guide"/-->
      <description>
Cortex-M System Design Kit: ARMv8M Baseline Processor based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00200000" startup="1" default="1"/>
      <memory id="IROM2" start="0x00200000" size="0x00200000" startup="0" default="0"/>
      <memory id="IRAM1" start="0x20000000" size="0x00200000" init   ="0" default="1"/>
      <memory id="IRAM2" start="0x20200000" size="0x00200000" init   ="0" default="0"/>

      <debugvars configfile="Device/CMSDK_ARMv8MBL/Debug/ARMv8MBL.dbgconf">
        // Debug Authentication Variables
        __var DAuthFixed  = 0x1;     // 1 - Use fixed authentication, 0 - Ask for user input
        __var DAuthConfig = 0xF;     // Authentication Value (MPS2 Security Control Block)
        // Bit 0 - Invasive Debug (Hardwired to 1)
        // Bit 1 - Non-Invasive Debug (Hardwired to 1)
        // Bit 2 - Invasive Secure Debug
        // Bit 3 - Non-Invasive Secure Debug
      </debugvars>

      <sequences>
        <!-- Local processor reset not avaialable in ARMv8-M -->
        <sequence name="ResetProcessor" disable="true"/>

        <sequence name="DebugDeviceUnlock">
          <block>
            __var DAuthUserInput  = 0;
            __var DAUTHSTATUS_Val = 0;
            __var DHCSR_Val       = 0;
            __var SecureDebugEna   = 0;
            __var SecureDebugAvail = 0;
            __var DAuthVal         = 0;

            DAUTHSTATUS_Val  = Read32(0xE000EFB8);
            DHCSR_Val        = Read32(0xE000EDF0);
            SecureDebugAvail = (DAUTHSTATUS_Val &amp; 0x00000020) ? 1 : 0;  // SID: Secure Invasive Debug Implemented
          </block>

          <control if="SecureDebugAvail" info="Configure Debug Authentication if Security Extensions available">
            <block>
              SecureDebugEna = ((DHCSR_Val &amp; 0x00100000) || ((DAUTHSTATUS_Val &amp; 0x00000030) == 0x00000030)) ? 1 : 0;
            </block>

            <control if="DAuthFixed">
              <block>
                // Debug Authentication as per Debug Configuration File
                DAuthVal = DAuthConfig;
              </block>
            </control>
            <control if="DAuthFixed == 0">
              <block>
                DAuthUserInput = Query(1, "Enable Secure Debug?", 3);
              </block>
              <control if="DAuthUserInput == 3">
                <block>
                  // Enable Secure Debug
                  DAuthVal = 0xF;
                </block>
              </control>
              <control if="DAuthUserInput != 3">
                <block>
                  // Disable Secure Debug
                  DAuthVal = 0x3;
                </block>
              </control>
            </control>

            <control if="SecureDebugEna">
              <block>
                // Setup Secure Debug
                Write32(0x50007000, DAuthVal);
              </block>
            </control>
            <control if="SecureDebugEna == 0">
              <control if="DAuthVal &amp; 0x4">
                <block>
                  Query(0, "Cannot configure Debug Authentication, secure debug disabled! Please reboot FPGA!", 1);
                </block>
              </control>
            </control>

          </control>
        </sequence>
      </sequences>

      <device Dname="CMSDK_ARMv8MBL">
        <processor Dcore="ARMV8MBL" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="MPU" Dtz="TZ" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_ARMv8MBL.svd"/>
        <compile header="Device/CMSDK_ARMv8MBL/Include/CMSDK_ARMv8MBL.h" define="CMSDK_ARMv8MBL"/>
      </device>
    </family>

    <!-- ******************************  ARMv8-M Mainline  *********************** -->
    <family Dfamily="ARMv8-M Mainline" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <!--book name="Device/Documents/ARMv8MML_dgug.pdf" title="ARMv8MML Device Generic Users Guide"/-->
      <description>
Cortex-M System Design Kit: ARMv8M Mainline Processor based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00200000" startup="1" default="1"/>
      <memory id="IROM2" start="0x00200000" size="0x00200000" startup="0" default="0"/>
      <memory id="IRAM1" start="0x20000000" size="0x00200000" init   ="0" default="1"/>
      <memory id="IRAM2" start="0x20200000" size="0x00200000" init   ="0" default="0"/>

      <debugvars configfile="Device/CMSDK_ARMv8MML/Debug/ARMv8MML.dbgconf">
        // Debug Authentication Variables
        __var DAuthFixed  = 0x1;     // 1 - Use fixed authentication, 0 - Ask for user input
        __var DAuthConfig = 0xF;     // Authentication Value (MPS2 Security Control Block)
        // Bit 0 - Invasive Debug (Hardwired to 1)
        // Bit 1 - Non-Invasive Debug (Hardwired to 1)
        // Bit 2 - Invasive Secure Debug
        // Bit 3 - Non-Invasive Secure Debug
      </debugvars>

