XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.V2M-MPS2_CMx_BSP.pdsc
      <sequences>
        <!-- Local processor reset not avaialable in ARMv8-M -->
        <sequence name="ResetProcessor" disable="true"/>

        <sequence name="DebugDeviceUnlock">
          <block>
            __var DAuthUserInput  = 0;
            __var DAUTHSTATUS_Val = 0;
            __var DHCSR_Val       = 0;
            __var SecureDebugEna   = 0;
            __var SecureDebugAvail = 0;
            __var DAuthVal         = 0;

            DAUTHSTATUS_Val  = Read32(0xE000EFB8);
            DHCSR_Val        = Read32(0xE000EDF0);
            SecureDebugAvail = (DAUTHSTATUS_Val &amp; 0x00000020) ? 1 : 0;  // SID: Secure Invasive Debug Implemented
          </block>

          <control if="SecureDebugAvail" info="Configure Debug Authentication if Security Extensions available">
            <block>
              SecureDebugEna = ((DHCSR_Val &amp; 0x00100000) || ((DAUTHSTATUS_Val &amp; 0x00000030) == 0x00000030)) ? 1 : 0;
            </block>

            <control if="DAuthFixed">
              <block>
                // Debug Authentication as per Debug Configuration File
                DAuthVal = DAuthConfig;
              </block>
            </control>
            <control if="DAuthFixed == 0">
              <block>
                DAuthUserInput = Query(1, "Enable Secure Debug?", 3);
              </block>
              <control if="DAuthUserInput == 3">
                <block>
                  // Enable Secure Debug
                  DAuthVal = 0xF;
                </block>
              </control>
              <control if="DAuthUserInput != 3">
                <block>
                  // Disable Secure Debug
                  DAuthVal = 0x3;
                </block>
              </control>
            </control>

            <control if="SecureDebugEna">
              <block>
                // Setup Secure Debug
                Write32(0x50007000, DAuthVal);
              </block>
            </control>
            <control if="SecureDebugEna == 0">
              <control if="DAuthVal &amp; 0x4">
                <block>
                  Query(0, "Cannot configure Debug Authentication, secure debug disabled! Please reboot FPGA!", 1);
                </block>
              </control>
            </control>

          </control>
        </sequence>
      </sequences>

      <device Dname="CMSDK_ARMv8MML">
        <processor Dcore="ARMV8MML" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="MPU" Dtz="TZ" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_ARMv8MML.svd"/>
        <compile header="Device/CMSDK_ARMv8MML/Include/CMSDK_ARMv8MML.h" define="CMSDK_ARMv8MML"/>
      </device>

      <device Dname="CMSDK_ARMv8MML_SP">
        <processor Dcore="ARMV8MML" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Dendian="Configurable" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_ARMv8MML_SP.svd"/>
        <compile header="Device/CMSDK_ARMv8MML/Include/CMSDK_ARMv8MML_SP.h" define="CMSDK_ARMv8MML_SP"/>
      </device>

      <device Dname="CMSDK_ARMv8MML_DP">
        <processor Dcore="ARMV8MML" DcoreVersion="r0p1" Dfpu="DP_FPU" Dmpu="MPU" Dtz="TZ" Dendian="Configurable" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_ARMv8MML_DP.svd"/>
        <compile header="Device/CMSDK_ARMv8MML/Include/CMSDK_ARMv8MML_DP.h" define="CMSDK_ARMv8MML_DP"/>
      </device>
    </family>
  </devices>

  <conditions>
    <condition id="ARMCC">
      <!--require Tcompiler="ARMCC"/-->
      <accept Tcompiler="ARMCC" Toptions="AC6"/>
      <accept Tcompiler="ARMCC" Toptions="AC6LTO"/>
    </condition>

    <condition id="GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="VHT">
      <require Dvendor="ARM:82" Dname="CMSDK_*VHT"/>
    </condition>

    <condition id="CMSDK_CM0 CMSIS">
      <description>ARM CMSDK_M0 Device and CMSIS Core</description>
      <accept  Dvendor="ARM:82" Dname="CMSDK_CM0"/>
      <accept  Dvendor="ARM:82" Dname="CMSDK_CM0_VHT"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK_CM0plus CMSIS">
      <description>ARM CMSDK_M0plus Device and CMSIS Core</description>
      <accept  Dvendor="ARM:82" Dname="CMSDK_CM0plus"/>
      <accept  Dvendor="ARM:82" Dname="CMSDK_CM0plus_VHT"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK_CM3 CMSIS">
      <description>ARM CMSDK_M3 Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_CM3*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK_CM4 CMSIS">
      <description>ARM CMSDK_M4 Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_CM4*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK_CM7 CMSIS">
      <description>ARM CMSDK_M7 Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_CM7*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK_ARMv8MBL CMSIS">
      <description>ARM CMSDK_ARMv8MBL Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_ARMv8MBL*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK_ARMv8MML CMSIS">
      <description>ARM CMSDK_ARMv8MML Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_ARMv8MML*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK CMSIS">
      <description>ARM Cortex-M System Design Kit Device</description>
      <accept  condition="CMSDK_CM0 CMSIS"/>
      <accept  condition="CMSDK_CM0plus CMSIS"/>
      <accept  condition="CMSDK_CM3 CMSIS"/>
      <accept  condition="CMSDK_CM4 CMSIS"/>
      <accept  condition="CMSDK_CM7 CMSIS"/>
      <accept  condition="CMSDK_ARMv8MBL CMSIS"/>
      <accept  condition="CMSDK_ARMv8MML CMSIS"/>
    </condition>

    <!--condition id="CMSDK CMSIS LCD_SPI">
      <description>CMSDK CMSIS and LCD (SPI IF)</description>
      <require condition="CMSDK CMSIS"/>
      <require Cclass="Graphics" Cgroup="CORE"/>
      <require Cclass="Graphics" Cgroup="Display" Csub="MCBQVGA_LG" Cvariant="SPI IF"/>
    </condition-->
  </conditions>

