XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.V2M-MPS2_CMx_BSP.pdsc
  <components>
    <!-- V2M-MPS2 Board support -->
    <bundle Cbundle="V2M-MPS2" Cclass="Board Support" Cversion="2.0.0">
      <description>ARM V2M_MPS2 Board Support</description>
      <doc></doc>
      <component Cgroup="LED"         Capiversion="1.0.0" condition="CMSDK CMSIS">
      <description>LED driver for ARM V2M_MPS2 Board</description>
        <files>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/LED_V2M-MPS2.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"     Capiversion="1.0.0" condition="CMSDK CMSIS">
      <description>Button driver for ARM V2M_MPS2 Board</description>
        <files>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/Buttons_V2M-MPS2.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="CMSDK CMSIS">
        <description>Graphic LCD driver for ARM V2M_MPS2 Board</description>
        <files>
          <file category="header" name="Boards/ARM/V2M-MPS2/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/GLCD_V2M-MPS2.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" condition="CMSDK CMSIS">
        <description>Touchscreen driver for ARM V2M_MPS2 Board</description>
        <files>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/Touch_V2M-MPS2.c"/>
        </files>
      </component>
      <!--component Cgroup="emWin LCD" Cvariant="SPI IF" condition="CMSDK CMSIS LCD_SPI">
        <description>emWin LCD SPI Interface for ARM V2M_MPS2 Board</description>
        <files>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/LCD_X_V2M-MPS2.c"/>
        </files>
      </component-->
    </bundle>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1.0" Cversion="1.0.3" condition="CMSDK CMSIS">
      <description>USART Driver for ARM V2M_MPS2 Board</description>
      <RTE_Components_h>
        #define RTE_Drivers_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USART_V2M-MPS2.c"/>
      </files>
    </component>

    <!-- CMSDK_M0 Startup -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.1.0" condition="CMSDK_CM0 CMSIS" isDefaultVariant="true">
      <description>System and Startup for ARM CMSDK_CM0 device</description>
      <files>
        <!-- include folder -->
        <file category="include"                        name="Device/CMSDK_CM0/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceC"                        name="Device/CMSDK_CM0/Source/startup_CMSDK_CM0.c"     version="1.1.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/CMSDK_CM0/Source/ARM/ac6_arm.sct"         version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/CMSDK_CM0/Source/GCC/gcc_arm.ld"          version="1.1.0" attr="config"/>
        <file category="sourceC"                        name="Device/CMSDK_CM0/Source/system_CMSDK_CM0.c"      version="1.1.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                       version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.1.0" condition="CMSDK_CM0 CMSIS">
      <description>DEPRECATED: System and Startup for ARM CMSDK_CM0 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"                        name="Device/CMSDK_CM0/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    condition="ARMCC" name="Device/CMSDK_CM0/Source/ARM/startup_CMSDK_CM0.S" version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/CMSDK_CM0/Source/ARM/ac6_arm.sct"         version="1.0.0" attr="config"/>
        <file category="sourceAsm"    condition="GCC"   name="Device/CMSDK_CM0/Source/GCC/startup_CMSDK_CM0.S" version="1.1.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/CMSDK_CM0/Source/GCC/gcc_arm.ld"          version="1.1.0" attr="config"/>
        <file category="sourceC"                        name="Device/CMSDK_CM0/Source/system_CMSDK_CM0.c"      version="1.1.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                       version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>

    <!-- CMSDK_M0+ Startup -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.1.0" condition="CMSDK_CM0plus CMSIS" isDefaultVariant="true">
      <description>System and Startup for ARM CMSDK_CM0plus device</description>
      <files>
        <!-- include folder -->
        <file category="include"                        name="Device/CMSDK_CM0plus/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceC"                        name="Device/CMSDK_CM0plus/Source/startup_CMSDK_CM0plus.c" version="1.1.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/CMSDK_CM0plus/Source/ARM/ac6_arm.sct"         version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/CMSDK_CM0plus/Source/GCC/gcc_arm.ld"          version="1.1.0" attr="config"/>
        <file category="sourceC"                        name="Device/CMSDK_CM0plus/Source/system_CMSDK_CM0plus.c"  version="1.1.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                           version="1.0.0" attr="config"/>

