XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.V2M-MPS2_CMx_BSP.pdsc
        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.1.0" condition="CMSDK_CM0plus CMSIS">
      <description>DEPRECATED: System and Startup for ARM CMSDK_CM0plus device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"                        name="Device/CMSDK_CM0plus/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    condition="ARMCC" name="Device/CMSDK_CM0plus/Source/ARM/startup_CMSDK_CM0plus.S" version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/CMSDK_CM0plus/Source/ARM/ac6_arm.sct"             version="1.0.0" attr="config"/>
        <file category="sourceAsm"    condition="GCC"   name="Device/CMSDK_CM0plus/Source/GCC/startup_CMSDK_CM0plus.S" version="1.1.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/CMSDK_CM0plus/Source/GCC/gcc_arm.ld"              version="1.1.0" attr="config"/>
        <file category="sourceC"                        name="Device/CMSDK_CM0plus/Source/system_CMSDK_CM0plus.c"      version="1.1.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                               version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>

    <!-- CMSDK_M3 Startup -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.1.0" condition="CMSDK_CM3 CMSIS" isDefaultVariant="true">
      <description>System and Startup for ARM CMSDK_CM3 device</description>
      <files>
        <!-- include folder -->
        <file category="include"                        name="Device/CMSDK_CM3/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceC"                        name="Device/CMSDK_CM3/Source/startup_CMSDK_CM3.c"     version="1.1.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/CMSDK_CM3/Source/ARM/ac6_arm.sct"         version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/CMSDK_CM3/Source/GCC/gcc_arm.ld"          version="1.1.0" attr="config"/>
        <file category="sourceC"                        name="Device/CMSDK_CM3/Source/system_CMSDK_CM3.c"      version="1.1.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                       version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.1.0" condition="CMSDK_CM3 CMSIS">
      <description>DEPRECATED: System and Startup for ARM CMSDK_CM3 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"                        name="Device/CMSDK_CM3/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    condition="ARMCC" name="Device/CMSDK_CM3/Source/ARM/startup_CMSDK_CM3.S" version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/CMSDK_CM3/Source/ARM/ac6_arm.sct"         version="1.0.0" attr="config"/>
        <file category="sourceAsm"    condition="GCC"   name="Device/CMSDK_CM3/Source/GCC/startup_CMSDK_CM3.S" version="1.1.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/CMSDK_CM3/Source/GCC/gcc_arm.ld"          version="1.1.0" attr="config"/>
        <file category="sourceC"                        name="Device/CMSDK_CM3/Source/system_CMSDK_CM3.c"      version="1.1.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                       version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>

    <!-- CMSDK_M4 Startup -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.1.0" condition="CMSDK_CM4 CMSIS" isDefaultVariant="true">
      <description>System and Startup for ARM CMSDK_CM4 device</description>
      <files>
        <!-- include folder -->
        <file category="include"                        name="Device/CMSDK_CM4/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceC"                        name="Device/CMSDK_CM4/Source/startup_CMSDK_CM4.c"     version="1.1.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/CMSDK_CM4/Source/ARM/ac6_arm.sct"         version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/CMSDK_CM4/Source/GCC/gcc_arm.ld"          version="1.1.0" attr="config"/>
        <file category="sourceC"                        name="Device/CMSDK_CM4/Source/system_CMSDK_CM4.c"      version="1.1.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                       version="1.0.0" attr="config"/>

