XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.V2M-MPS2_CMx_BSP.pdsc
        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.1.0" condition="CMSDK_ARMv8MBL CMSIS">
      <description>DEPRECATED: System and Startup for ARM CMSDK_ARMv8MBL device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"                        name="Device/CMSDK_ARMv8MBL/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    condition="ARMCC" name="Device/CMSDK_ARMv8MBL/Source/ARM/startup_CMSDK_ARMv8MBL.S"         version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/CMSDK_ARMv8MBL/Source/ARM/ac6_arm.sct"                      version="1.0.0" attr="config"/>
        <file category="sourceAsm"    condition="GCC"   name="Device/CMSDK_ARMv8MBL/Source/GCC/startup_CMSDK_ARMv8MBL.S"         version="1.1.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/CMSDK_ARMv8MBL/Source/GCC/gcc_arm.ld"                       version="1.1.0" attr="config"/>
        <file category="sourceC"                        name="Device/CMSDK_ARMv8MBL/Source/system_CMSDK_ARMv8MBL.c"              version="1.1.0" attr="config"/>
        <!-- SAU configuration -->
        <file category="header"                         name="Device/CMSDK_ARMv8MBL/Include/Template/partition_CMSDK_ARMv8MBL.h" version="1.1.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                                         version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>

    <!-- CMSDK_ARMv8MML Startup -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.1.0" condition="CMSDK_ARMv8MML CMSIS" isDefaultVariant="true">
      <description>System and Startup for ARM CMSDK_ARMv8MML device</description>
      <files>
        <!-- include folder -->
        <file category="include"                        name="Device/CMSDK_ARMv8MML/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceC"                        name="Device/CMSDK_ARMv8MML/Source/startup_CMSDK_ARMv8MML.c"             version="1.1.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/CMSDK_ARMv8MML/Source/ARM/ac6_arm.sct"                      version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/CMSDK_ARMv8MML/Source/GCC/gcc_arm.ld"                       version="1.1.0" attr="config"/>
        <file category="sourceC"                        name="Device/CMSDK_ARMv8MML/Source/system_CMSDK_ARMv8MML.c"              version="1.1.0" attr="config"/>
        <!-- SAU configuration -->
        <file category="header"                         name="Device/CMSDK_ARMv8MML/Include/Template/partition_CMSDK_ARMv8MML.h" version="1.1.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                                         version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.1.0" condition="CMSDK_ARMv8MML CMSIS">
      <description>DEPRECATED: System and Startup for ARM CMSDK_ARMv8MML device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"                        name="Device/CMSDK_ARMv8MML/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    condition="ARMCC" name="Device/CMSDK_ARMv8MML/Source/ARM/startup_CMSDK_ARMv8MML.S"         version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/CMSDK_ARMv8MML/Source/ARM/ac6_arm.sct"                      version="1.0.0" attr="config"/>
        <file category="sourceAsm"    condition="GCC"   name="Device/CMSDK_ARMv8MML/Source/GCC/startup_CMSDK_ARMv8MML.S"         version="1.1.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/CMSDK_ARMv8MML/Source/GCC/gcc_arm.ld"                       version="1.1.0" attr="config"/>
        <file category="sourceC"                        name="Device/CMSDK_ARMv8MML/Source/system_CMSDK_ARMv8MML.c"              version="1.1.0" attr="config"/>
        <!-- SAU configuration -->
        <file category="header"                         name="Device/CMSDK_ARMv8MML/Include/Template/partition_CMSDK_ARMv8MML.h" version="1.1.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                                         version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>

  </components>

  <boards>
    <board name="V2M-MPS2" vendor="ARM" revision="B" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp">
      <description>ARM Versatile Express Cortex-M Prototyping System Board</description>
      <image small="Boards/ARM/V2M-MPS2/Documents/V2M-MPS2_revB_colour_thumb.png"
             large="Boards/ARM/V2M-MPS2/Documents/V2M-MPS2_revB_colour_medium.png"/>
      <book category="overview" name="http://www.arm.com/products/tools/development-boards/versatile-express/cortex-m-prototyping-system.php" title="Cortex-M Prototyping System (web page)"/>
      <book category="manual"   name="Boards/ARM/V2M-MPS2/Documents/DDI0479C_cortex_m_system_design_kit_r1p0_trm.pdf"                         title="Cortex-M System Design Kit Technical Reference Manual"/>
      <book category="other"    name="Boards/ARM/V2M-MPS2/Documents/DAI0382C_cortex_m0_on_v2m_mps2.pdf"                                       title="Application Note AN382: ARM Cortex-M0 SMM on V2M-MPS2"/>
      <book category="other"    name="Boards/ARM/V2M-MPS2/Documents/DAI0383C_cortex_m0plus_on_v2m_mps2.pdf"                                   title="Application Note AN383: ARM Cortex-M0+ SMM on V2M-MPS2"/>
      <book category="other"    name="Boards/ARM/V2M-MPS2/Documents/DAI0385C_cortex_m3_on_v2m_mps2.pdf"                                       title="Application Note AN385: ARM Cortex-M3 SMM on V2M-MPS2"/>
      <book category="other"    name="Boards/ARM/V2M-MPS2/Documents/DAI0386C_cortex_m4_on_v2m_mps2.pdf"                                       title="Application Note AN386: ARM Cortex-M4 SMM on V2M-MPS2"/>
      <book category="other"    name="Boards/ARM/V2M-MPS2/Documents/DAI0399C_cortex_m7_on_v2m_mps2.pdf"                                       title="Application Note AN399: ARM Cortex-M7 SMM on V2M-MPS2"/>
      <mountedDevice    deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_CM7"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_CM7_SP"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_CM7_DP"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_CM4"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_CM4_FP"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_CM3"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_CM0"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_CM0plus"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_ARMv8MML"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_ARMv8MML_SP"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_ARMv8MML_DP"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="CMSDK_ARMv8MBL"/>
      <feature type="XTAL"      n="50000000"/>
      <feature type="PWR"       n="12"             name="12V DC power jack"/>
      <feature type="Batt"      n="1"              name="3V battery"/>
      <feature type="Button"    n="4"              name="Push-buttons: 2 FPGA User, Hardware RESET, ON/OFF soft RESET"/>
      <feature type="ContOther" n="8"              name="Switches: 8 MCC User switches"/>
      <feature type="USB"       n="1"              name="USB 2.0 configuration port"/>
      <feature type="RS232"     n="1"              name="General purpose UART Connector"/>
      <feature type="SPI"       n="1"              name="SPI Header"/>
      <feature type="Other"     n="1"              name="VGA Connector"/>
      <feature type="GLCD"      n="1"  m="240.320" name="2.4 inch QVGA Touchscreen Display"/>
      <feature type="LineIn"    n="1"              name="Stereo line audio IN"/>
      <feature type="LineOut"   n="1"              name="Stereo line audio OUT"/>
      <feature type="ETH"       n="1" m="10000000" name="RJ45 Ethernet Connector"/>
      <feature type="ConnOther" n="1"              name="ARM JTAG 20 Interface"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug (20 Pin) Interface"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug (10 Pin) Interface"/>
      <feature type="ConnOther" n="1"              name="MICTOR 38 Interface"/>

