XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.V2M-MPS2_CMx_BSP.pdsc
      <debugInterface adapter="JTAG/SW"   connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW"   connector="20 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW"   connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- V2M-MPS2 Board CMSDK_M0 Examples -->
    <!-- Image: AN382 -->
    <example name="CMSIS RTOS Blinky -CMSDK_CM0" doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_CM0/RTX_Blinky">
      <description>CMSIS RTOS based Blinky example</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="Blinky -CMSDK_CM0"            doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_CM0/Blinky">
      <description>Blinky example</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- V2M-MPS2 Board CMSDK_M0plus Examples -->
    <!-- Image: AN383 -->
    <example name="CMSIS RTOS Blinky -CMSDK_CM0Plus" doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_CM0plus/RTX_Blinky">
      <description>CMSIS RTOS based Blinky example</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="Blinky -CMSDK_CM0plus"            doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_CM0plus/Blinky">
      <description>Blinky example</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- V2M-MPS2 Board CMSDK_M3 Examples -->
    <!-- Image: AN385 -->
    <example name="CMSIS RTOS Blinky -CMSDK_CM3" doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_CM3/RTX_Blinky">
      <description>CMSIS RTOS based Blinky example</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="Blinky -CMSDK_CM3"            doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_CM3/Blinky">
      <description>Blinky example</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- V2M-MPS2 Board CMSDK_M4_FP Examples -->
    <!-- Image: AN386 -->
    <example name="CMSIS RTOS Blinky -CMSDK_CM4_FP" doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_CM4_FP/RTX_Blinky">
      <description>CMSIS RTOS based Blinky example</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="Blinky -CMSDK_CM4_FP"            doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_CM4_FP/Blinky">
      <description>Blinky example</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- V2M-MPS2 Board CMSDK_CM7_SP Examples -->
    <!-- Image: AN500 -->
    <example name="CMSIS RTOS Blinky -CMSDK_CM7_SP" doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_CM7_SP/RTX_Blinky">
      <description>CMSIS RTOS based Blinky example</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="Blinky -CMSDK_CM7_SP"            doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_CM7_SP/Blinky">
      <description>Blinky example</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- V2M-MPS2 Board CMSDK_ARMv8MBL Examples -->
    <!-- Image: AN486 -->
    <example name="ARMv8MBL Secure/Non-Secure"     doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_ARMv8MBL/ARMv8MBL_S_NS">
      <description>ARMv8MBL Secure/Non-Secure example</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="ARMv8MBL_s_ns.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ARMv8MBL Secure/Non-Secure GCC" doc="README.md" folder="Boards/ARM/V2M-MPS2/CMSDK_ARMv8MBL/ARMv8MBL_S_NS.GCC">
      <description>ARMv8MBL Secure/Non-Secure example (tool chain GCC)</description>
      <board name="V2M-MPS2" vendor="ARM"/>
      <project>
        <environment name="uv" load="ARMv8MBL_s_ns.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

  </examples>

</package>
